In [1]:
import numpy as np
import time
a = np.random.random(10000000)
b = np.random.random(10000000)


# Normal Version.
tic = time.time()
c = 0
for i in range(10000000):
    c += a[i]*b[i]
toc = time.time()
print('Normal : ', (toc-tic)*1000, 'Result', round(c, 2))

# Vetorizted version. 
tic = time.time()
c = np.dot(a,b)
toc = time.time()
print('Vectorized: ',(toc-tic)*1000, 'Result', round(c, 2))

Vectorized:  17.09890365600586 Result 2500660.81
Normal :  1939.2738342285156 Result 2500660.81

In [4]:
#ndarray

a  = np.array([[1,2,3, 4],
               [5, 6, 7, 8]]
             )
a

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [6]:
a.size

8

In [ ]:
a.shape

(2, 4)

In [14]:
a  = np.array([[1,2,3, 4],
               [5, 6, 7, 8]]
             )
b  = np.array([[1, 4, 6, 4],
               [5, 6, 7, 8]]
             )

In [15]:
a + b

array([[ 2,  6,  9,  8],
       [10, 12, 14, 16]])

In [19]:
# Boradcasting
a  = np.array([[1,2,3, 4],
               [5, 6, 7, 8]])
b = np.array([1, 2, 3,  4])
              
a + b

#(2, 4) + (4, 1)

a.flatten()

array([1, 2, 3, 4, 5, 6, 7, 8])

In [30]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [32]:

df = pd.read_csv('https://raw.githubusercontent.com/unalyticsteam/datasets/master/titanic.csv')
df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [25]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    object
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(3), object(3)
memory usage: 55.6+ KB

In [34]:
df['Pclass'] = df['Pclass'].astype('object')

In [38]:
df[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  27.719745
male    30.431361